Revit 2027 API
ExportPDFSettings.FindByName Method
 Returns settings element by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportPDFSettings FindByName(
	Document document,
	string name
)
Public Shared Function FindByName (
	document As Document,
	name As String
) As ExportPDFSettings
public:
static ExportPDFSettings^ FindByName(
	Document^ document,
	String^ name
)
static member FindByName :
        document : Document *
        name : string -> ExportPDFSettings
Parameters
document Document
 The document to find the settings with the specified name.
name String
 Name of the settings to find.
Return Value
ExportPDFSettings
 The settings element, or null if not found.
Exceptions
Exception | Condition
ArgumentException |  name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPDFSettings Class
Autodesk.Revit.DB Namespace